/* База данных "rent_apartments" предназначена для сервиса размещения объявлений о сдаче квартир в аренду для физических лиц. 
Примером послужил соответствующий раздел сайта "avito.ru". Сервис предоставляет зарегистрированным пользователям размещать объявления 
о сдаче квартир, искать квартиры для аренды по множеству различных параметров, общаться между собой и оценивать друг друга как участников 
рынка. База включает две основные сущности - это пользователи и объявления о сдаче квартиры в аренду. Информация о пользователях сервиса 
размещена в таблицах "users" и "profiles"; об объявлениях - в "rent_apartments_ads" и "ads_profiles". Кроме этого есть следующие таблицы: 
photos (фотографии), phones (телефоны), social_networks (социальные сети), users_accounts (аккаунты пользователей в социальных сетях), 
notices (уведомления пользователей от сервиса), messages (сообщения между пользователями), feedback (отзывы пользователей друг о друге),  
citys (города), regions (регионы), home_types (типы домов), favorite_users (избранные пользователи), favorite_ads (избранные объявления), 
transactions (заключённые сделки), mutualy_favorites (взаимно избранные пользователи). */